app/Controllers/Auth.php

INSERT INTO `users` (`username`, `password`) VALUES ('admin', '$2y$10$69DEzkfkd5ndqVcluQ8/IeaSVdj5UVN/z8U3LAdome1HnhH548yfG')
---
    public function registerProcess()
    {
        $model = new UserModel();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $password_confirm = $this->request->getVar('password_confirm');

        // Memeriksa apakah password dan konfirmasi password cocok
        if ($password !== $password_confirm) {
            session()->setFlashdata('error', 'Password tidak cocok');
            return redirect()->to('/register');
        }

        // Hash password sebelum disimpan
        $password_hash = password_hash($password, PASSWORD_DEFAULT);

        // Menyimpan data user baru
        $model->save([
            'username' => $username,
            'password' => $password_hash
        ]);