app/Models/todolistModel.php

SELECT *
FROM `todos`
---
    public function getTodos()
    {
        return $this->findAll();

INSERT INTO `todos` (`task`, `status`) VALUES ('beli bakso', 'pending')
---
    public function addTodo($task)
    {
        $data = [
            'task' => $task,
            'status' => 'pending'
        ];
        $this->save($data);

UPDATE `todos` SET `status` = 'completed'
WHERE `todos`.`id` IN ('39')
---
    public function completeTodo($id)
    {
        $this->update($id, ['status' => 'completed']);

DELETE FROM `todos`
WHERE `id` IN ('39')
---
    public function deleteTodo($id)
    {
        $this->delete($id);

SELECT COUNT(*) AS `numrows` FROM `todos`
---
    public function getTodoCount()
    {
        return $this->countAll();